# Topics: Starting with Pandas, Series and DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([4,5,6,7])
s

0    4
1    5
2    6
3    7
dtype: int64

In [3]:
s.values

array([4, 5, 6, 7], dtype=int64)

In [4]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
s1 = pd.Series([4,7,8,-2],index=['d','b','a','c'])
s1

d    4
b    7
a    8
c   -2
dtype: int64

In [6]:
s1*3

d    12
b    21
a    24
c    -6
dtype: int64

In [7]:
np.exp(s1)

d      54.598150
b    1096.633158
a    2980.957987
c       0.135335
dtype: float64

In [8]:
'e' in s1

False

In [9]:
series_dict = {'Rawalpindi':46000,'Quetta':87300,'Karachi':72500,'Abbotabad':22020}

In [10]:
series_dict = pd.Series(series_dict)
series_dict

Rawalpindi    46000
Quetta        87300
Karachi       72500
Abbotabad     22020
dtype: int64

In [11]:
cities = ['Punjab','Balochistan','Sindh','KPK']
series_dict_2 = pd.Series(series_dict, index=cities)
series_dict_2

Punjab        NaN
Balochistan   NaN
Sindh         NaN
KPK           NaN
dtype: float64

In [12]:
# Pandas Data Frame

In [13]:
data = {'Cities':['Karachi','Lahore','Islamabad','Rawalpindi','Quetta'],
       'Year':['2021','2021','2021','2021','2021'],
       'Population':[1.6,1.3,1.16,2.28,1.13]}
cities_data = pd.DataFrame(data)
cities_data

       Cities  Year  Population
0     Karachi  2021        1.60
1      Lahore  2021        1.30
2   Islamabad  2021        1.16
3  Rawalpindi  2021        2.28
4      Quetta  2021        1.13

In [14]:
cities_data.head() #Prints only first 5 rows

       Cities  Year  Population
0     Karachi  2021        1.60
1      Lahore  2021        1.30
2   Islamabad  2021        1.16
3  Rawalpindi  2021        2.28
4      Quetta  2021        1.13

In [15]:
# Changing sequence of Columns

pd.DataFrame(cities_data, columns=['Year','Cities','Population'])

   Year      Cities  Population
0  2021     Karachi        1.60
1  2021      Lahore        1.30
2  2021   Islamabad        1.16
3  2021  Rawalpindi        2.28
4  2021      Quetta        1.13

In [16]:
cities_data['Population']

0    1.60
1    1.30
2    1.16
3    2.28
4    1.13
Name: Population, dtype: float64

In [17]:
cities_data['Debt'] = np.arange(5.)
print(cities_data)


val = pd.Series([-1.2,-1.5,-3.4,-1.9,-2.1])
cities_data['Debt'] = val

cities_data

       Cities  Year  Population  Debt
0     Karachi  2021        1.60   0.0
1      Lahore  2021        1.30   1.0
2   Islamabad  2021        1.16   2.0
3  Rawalpindi  2021        2.28   3.0
4      Quetta  2021        1.13   4.0

       Cities  Year  Population  Debt
0     Karachi  2021        1.60  -1.2
1      Lahore  2021        1.30  -1.5
2   Islamabad  2021        1.16  -3.4
3  Rawalpindi  2021        2.28  -1.9
4      Quetta  2021        1.13  -2.1

In [18]:
# Deleting a column

del cities_data['Debt']

cities_data

       Cities  Year  Population
0     Karachi  2021        1.60
1      Lahore  2021        1.30
2   Islamabad  2021        1.16
3  Rawalpindi  2021        2.28
4      Quetta  2021        1.13